openfoam/2DWMH/pitzDailyModified/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    b2-symmetry_y_strong
    {
        type            empty;
        physicalType    patch;
        nFaces          44064;
        startFace       87612;
    }
    b3-symmetry_y_strong
    {
        type            empty;
        physicalType    patch;
        nFaces          44064;
        startFace       131676;
    }
    b4-subsonic_inflow_pt
    {
        type            patch;
        physicalType    patch;
        nFaces          108;
        startFace       175740;
    }
    b5-back_pressure
    {
        type            patch;
        physicalType    patch;
        nFaces          108;
        startFace       175848;
    }
    b6-viscous_solid
    {
        type            patch;
        physicalType    patch;
        nFaces          408;
        startFace       175956;
    }
    b7-tangency
    {
        type            patch;
        physicalType    patch;
        nFaces          408;
        startFace       176364;
    }
)

// ************************************************************************* //
