openfoam/2DWMH/pitzDailyModified/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 4.16e-5;

boundaryField
{
   b2-symmetry_y_strong
    {
        type            empty;

    }
    b3-symmetry_y_strong
    {
        type            empty;
    }
    b4-subsonic_inflow_pt
    {
        type            fixedValue;
        value           uniform 4.16e-5;
    }
    b5-back_pressure
    {
        type            zeroGradient;
    }
    b6-viscous_solid
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    b7-tangency
    {
        type            zeroGradient;

    }
}


// ************************************************************************* //
